import { type ClassValue, clsx } from "clsx";
import { twMerge } from "tailwind-merge";

export function cn(...inputs: ClassValue[]) {
  return twMerge(clsx(inputs));
}

export const initialPrices: { [key: string]: number } = {
  "601398": 4.74,
  "600519": 1701.0,
  "600276": 48.06,
  "600309": 86.72,
  "600009": 47.37,
  "603288": 63.98,
  "600048": 12.83,
  "600585": 25.6,
  "600028": 6.09,
  "600588": 19.43,
  "300347": 86.81,
  "300750": 224.09,
  "300059": 15.1,
  "300024": 15.3,
  "300498": 17.28,
  "300760": 314.71,
  "300015": 28.27,
  "300295": 13.33,
  "300288": 19.55,
  "300002": 10.87,
  "000069": 4.71,
  "002507": 23.97,
  "002714": 42.84,
  "000651": 34.34,
  "000858": 168.2,
  "002415": 34.95,
  "002179": 43.12,
  "000776": 15.02,
  "002511": 12.07,
  "002007": 22.03,
};

export const stockNameList = [
  {
    Code: "601398",
    Name: "工商银行",
  },
  {
    Code: "600519",
    Name: "贵州茅台",
  },
  {
    Code: "600276",
    Name: "恒瑞医药",
  },
  {
    Code: "600309",
    Name: "万华化学",
  },
  {
    Code: "600009",
    Name: "上海机场",
  },
  {
    Code: "603288",
    Name: "海天味业",
  },
  {
    Code: "600048",
    Name: "保利发展",
  },
  {
    Code: "600585",
    Name: "海螺水泥",
  },
  {
    Code: "600028",
    Name: "中国石化",
  },
  {
    Code: "600588",
    Name: "用友网络",
  },
  {
    Code: "300347",
    Name: "泰格医药",
  },
  {
    Code: "300750",
    Name: "宁德时代",
  },
  {
    Code: "300059",
    Name: "东方财富",
  },
  {
    Code: "300024",
    Name: "机器人",
  },
  {
    Code: "300498",
    Name: "温氏股份",
  },
  {
    Code: "300760",
    Name: "迈瑞医疗",
  },
  {
    Code: "300015",
    Name: "爱尔眼科",
  },
  {
    Code: "300295",
    Name: "三六五网",
  },
  {
    Code: "300288",
    Name: "朗玛信息",
  },
  {
    Code: "300002",
    Name: "神州泰岳",
  },
  {
    Code: "000069",
    Name: "华侨城A",
  },
  {
    Code: "002507",
    Name: "涪陵榨菜",
  },
  {
    Code: "002714",
    Name: "牧原股份",
  },
  {
    Code: "000651",
    Name: "格力电器",
  },
  {
    Code: "000858",
    Name: "五粮液",
  },
  {
    Code: "002415",
    Name: "海康威视",
  },
  {
    Code: "002179",
    Name: "中航光电",
  },
  {
    Code: "000776",
    Name: "广发证券",
  },
  {
    Code: "002511",
    Name: "中顺洁柔",
  },
  {
    Code: "002007",
    Name: "华兰生物",
  },
];
